#здесь ничего менять не нужно, просто запусти и посмиотри результат
#во всех последующий файлах, если сверху не написано,что тебе нужно что-то сделать, то не делай
#есть надпись что-то сделать: сделай что написано
# нет надписи: и делать ничего не надо, только запустить и посмотреть результаты

#весь текст который идёт после знака # компьютер будет игнорировать, он здесь чтобы обьяснять тебе что происходит



a=10        #создаю переменную, под название a и с помощью = записываю в неё 10
b=20        #создаю переменную, под название b и с помощью = записываю в неё 20

#любую информацию можно записать в переменую 
#переменную можно называть как хочешь

#шаблон создания переменной:
#имя переменной = данные которые ты хочешь в неё сохранить 


c=a+b     #создал новую переменную, назвал её с, записал в неё следующие данные: сумму a и b
          #в свою очередь в переменных a и b хранятся 10 и 20, значит записи c=10+20 и c=a+b одинаковы
          #и дадут одинаковый результат

# использование переменных упрощает работу с большими данными и с одинаковыми данными
# пример

a=12345678      #создал переменную a
b=987654321     #создал переменную b
c=a+b           #сложил их и результат записал в c
d=a*a           #умножил их и результат записал в d
e=b-a           #отнял одно из другого и результат записал в e
f=b/a           #поделил одну на другое и результат записал в f

# это был вариант использования переменных

#дальше вариант тех же действий, которые дадут тот же результат, но без переменных

c=12345678+987654321
d=12345678*12345678
e=987654321-12345678
f=987654321/12345678

# написать все эти числа один раз в переменны и после использовать их просто проще, чем каждый раз переписывать теже значения


