#чтож, едем дальше
#нужно создать 2 переменные 
#одна будет равна 12, другая будет равна 5
#нужно проделать все математические действия с этими 2 переменными, которые я сейчас напишу 
#но делать их не в print(), а создать для этого новую переменную
#пример: c=a+b  e=a-b и т.д. 
#метематические действия: 
# + сложение
# - вычитание
# / деление
# * умножение
# // челочисленное деление
# % остаток от деления
# ** возведение в степень 
#проделай эти действия с двумя переменными, сохрани результат в новые и в одном принте выведи сразу все результаты 
# пример принта print(c,d,e и так далее)

#посмотри на результаты и проанализируй их, дальше будет обьяснения для них

# код и результат выполнения этого файла нужно будет отправить мне, 
# лучше сделать скриншот и скинуть напрямую с компьютера в телеграмме